In [13]:
import numpy as np
import pandas as pd

#np.set_printoptions? -help

In [14]:
np.set_printoptions(precision=2)

In [15]:
from pandas import read_csv
data_train = pd.read_csv('train.csv') #, sep=';'
data_test = pd.read_csv('test.csv')  #, sep='.'

## What is the type

LaTeX???

$$aˆ2 + bˆ2 = cˆ2$$

In [16]:
type(data_train)
type(data_test)

pandas.core.frame.DataFrame

In [17]:
data_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
data_train.shape #data size

(891, 12)

In [20]:
data_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [18]:
data_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Take data only columns

In [23]:
data_train["Age"].head() #type(data_train["Age"])

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

# loc and iloc

In [35]:
data_train.loc[0:5, ['Age', 'Fare', 'Pclass']]

    Age     Fare  Pclass
0  22.0   7.2500       3
1  38.0  71.2833       1
2  26.0   7.9250       3
3  35.0  53.1000       1
4  35.0   8.0500       3
5   NaN   8.4583       3

In [37]:
data_train.iloc[:,2:4].head()

   Pclass                                               Name
0       3                            Braund, Mr. Owen Harris
1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2       3                             Heikkinen, Miss. Laina
3       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4       3                           Allen, Mr. William Henry

Bolean mask

In [38]:
data_train['Pclass'] == 2

0      False
1      False
2      False
3      False
4      False
       ...
886     True
887    False
888    False
889    False
890    False
Name: Pclass, Length: 891, dtype: bool

In [63]:
data_train[data_train['Pclass'] == 2].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_my,new_summ
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,0,102
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S,0,102
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S,0,102
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S,0,102
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S,0,102

In [45]:
data_train[data_train['Pclass'] == 2]['Fare']

9      30.0708
15     16.0000
17     13.0000
20     26.0000
21     13.0000
        ...
866    13.8583
874    24.0000
880    26.0000
883    10.5000
886    13.0000
Name: Fare, Length: 184, dtype: float64

In [52]:
data_train[data_train['Pclass'] == 1]['Fare'].mean(), \
data_train[data_train['Pclass'] == 2]['Fare'].mean(), \
data_train[data_train['Pclass'] == 3]['Fare'].mean()  #max,min,..

(84.1546875, 20.662183152173913, 13.675550101832993)

In [71]:
data_train[(data_train['Age'] <= 20) & (data_train['Pclass'] == 1) & (data_train['Sex'] == 'male')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.00,3,2,19950,263.0000,C23 C25 C27,S
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
445,446,1,1,"Dodge, Master. Washington",male,4.00,0,2,33638,81.8583,A34,S
505,506,0,1,"Penasco y Castellana, Mr. Victor de Satode",male,18.00,1,0,PC 17758,108.9000,C65,C
550,551,1,1,"Thayer, Mr. John Borland Jr",male,17.00,0,2,17421,110.8833,C70,C
748,749,0,1,"Marvin, Mr. Daniel Warner",male,19.00,1,0,113773,53.1000,D30,S
802,803,1,1,"Carter, Master. William Thornton II",male,11.00,1,2,113760,120.0000,B96 B98,S

In [19]:
data_train[(data_train['Age'] <= 20) & (data_train['Pclass'] == 1) & (data_train['Sex'] == 'male')].median()

PassengerId    506.0000
Survived         1.0000
Pclass           1.0000
Age             17.0000
SibSp            1.0000
Parch            2.0000
Fare           110.8833
dtype: float64

#group by

In [24]:
for i in data_train.groupby('Pclass'):
    print(type(i))

<class 'tuple'>
<class 'tuple'>
<class 'tuple'>

In [26]:
for Pclass, sub_tf in data_train.groupby('Pclass'):
    print(Pclass)
    
    print(sub_tf['Age'].median())

1
37.0
2
29.0
3
24.0

In [29]:
for Pclass, sub_tf in data_train.groupby(['Pclass', 'Sex']):
    print(Pclass)
    
    #print(sub_tf['Age'].median())

(1, 'female')
(1, 'male')
(2, 'female')
(2, 'male')
(3, 'female')
(3, 'male')

In [32]:
data_train.groupby('Pclass')[['Age', 'Fare']].agg(np.mean)

              Age       Fare
Pclass
1       38.233441  84.154687
2       29.877630  20.662183
3       25.140620  13.675550

In [35]:
pd.crosstab(data_train['Pclass'], data_train['Sex'])

Sex     female  male
Pclass
1           94   122
2           76   108
3          144   347

In [39]:
pd.crosstab(data_train['Pclass'], data_train['Survived'])

Survived    0    1
Pclass
1          80  136
2          97   87
3         372  119

create new category
- Add or plus or minus
- lambda or def
- dictionary with map

In [46]:
data_train['Fare'].describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

In [43]:
data_train['new_my'] = (data_train['Fare'] > 
                        data_train['Fare'].quantile(.75))

In [45]:
data_train['new_my'] = (data_train['Fare'] > 
                    data_train['Fare'].quantile(.75)).astype('int64')

In [52]:
data_train['new_summ'] = data_train['Pclass'] + 100

In [54]:
#df.apply(np.mean)

In [57]:
def string_gender(female):
    return 'female' if female else 'male'

In [58]:
string_gender(1)

'female'

In [59]:
data_train['Sex'].apply(string_gender)

0      female
1      female
2      female
3      female
4      female
        ...
886    female
887    female
888    female
889    female
890    female
Name: Sex, Length: 891, dtype: object

In [65]:
data_train['Sex'].apply(lambda female: 'female' if female else 'male')

0      female
1      female
2      female
3      female
4      female
        ...
886    female
887    female
888    female
889    female
890    female
Name: Sex, Length: 891, dtype: object

In [66]:
d = {1: 'first', 2: 'second', 3: 'next'} #create dictionary

In [67]:
data_train['Pclass'].map(d).head()

0     next
1    first
2     next
3    first
4     next
Name: Pclass, dtype: object